spec/dummy/app/controllers/manuscripts_controller.rb

SELECT "manuscripts".* FROM "manuscripts"
---
  def index
    @manuscripts = Manuscript.all

SELECT "manuscripts".* FROM "manuscripts" WHERE "manuscripts"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @manuscript = Manuscript.find(params[:id])

SELECT "manuscripts".* FROM "manuscripts" WHERE "manuscripts"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @manuscript = Manuscript.find(params[:id])

INSERT INTO "manuscripts" ("created_at", "main_lang_id", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Sat, 26 May 2012 21:08:38 UTC +00:00], ["main_lang_id", "47"], ["name", ""], ["updated_at", Sat, 26 May 2012 21:08:38 UTC +00:00]]
---
  def create
    @manuscript = Manuscript.new(params[:manuscript])

    respond_to do |format|
      if @manuscript.save

SELECT "manuscripts".* FROM "manuscripts" WHERE "manuscripts"."id" = ? LIMIT 1  [["id", "1"]]
---
  def update
    @manuscript = Manuscript.find(params[:id])